# WireSize Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireSize Class
Members See Also
---
Represents specific electrical wire size information.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class WireSize : APIObject
```

Visual Basic
---
```text
Public Class WireSize _
	Inherits APIObject
```

Visual C++
---
```text
public ref class WireSize : public APIObject
```

# Remarks
Wire size is defined based on corresponding wire material type and temperature rating type.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..WireSize
# See Also
WireSize Members
Autodesk.Revit.DB.Electrical Namespace